DataProcessors/ГрупповоеЗакрытиеМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ГрупповоеЗакрытиеМесяца</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/ЗакрытиеМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗакрытиеМесяца</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоСубсидиям</xr:Item>
				<xr:Item>InformationRegister.СостояниеРеструктуризацииДолга</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ГрупповоеЗакрытиеМесяца/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтображениеПериодаПриИзменении(Элемент)
	ЭтаФорма.Объект.Дата 		= КонецМесяца(ЭтаФорма.Объект.Дата);
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ЭтаФорма.ОтображениеПериода	= Формат(ЭтаФорма.Объект.Дата, НСтр(ФорматнаяСтрока));
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.Объект.Дата= Дата('00010101'), ТекущаяДата(), ЭтаФорма.Объект.Дата));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ЭтаФорма.Объект.Дата = КонецДня(ДатаКалендаряНачало);
	
	ОтображениеПериодаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	ЭтаФорма.Объект.Дата = ?(ЗначениеЗаполнено(ЭтаФорма.Объект.Дата), 
						ДобавитьМесяц(ЭтаФорма.Объект.Дата, Направление),
						ДобавитьМесяц(КонецМесяца(ТекущаяДата()), Направление));
						
	ОтображениеПериодаПриИзменении(Элемент);
КонецПроцедуры

&НаСервере
Процедура СоздатьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗданияИСооружения.Ссылка
		|ИЗ
		|	Справочник.ЗданияИСооружения КАК ЗданияИСооружения
		|ГДЕ
		|	ЗданияИСооружения.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Док = Документы.ЗакрытиеМесяца.СоздатьДокумент();
		Док.Дата = КонецМесяца(Объект.Дата);
		Док.Организация = Объект.Организация;
		Док.Здание = Выборка.Ссылка;
		//Док.ЭтотОбъект.ОтображениеПериода = ЭтотОбъект.ОтображениеПериода;
		Попытка
		    Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение		
			Док.Записать();
		    Сообщить("Не вдалося провести документ " + Док.Ссылка);		
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	СоздатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.Дата = ТекущаяДата();
КонецПроцедуры
